IDENTIFICATION DIVISION.
PROGRAM-ID. DIFFERENT.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 INP PIC X(50).
        88 EOF VALUE SPACES.
    01 A PIC S9(16).
    01 B PIC S9(16).
    01 OUTP PIC Z(15)9.

PROCEDURE DIVISION.
    PERFORM FOREVER
        ACCEPT INP
        IF EOF EXIT PERFORM
        END-IF

        UNSTRING INP
            DELIMITED BY SPACE
            INTO A, B

        SUBTRACT B FROM A
        MOVE FUNCTION ABS(A) TO OUTP

        DISPLAY OUTP
    END-PERFORM.
